zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/include/stm32mp13xx_hal_xspi.h
/**
  ******************************************************************************
  * @file    stm32mp13xx_hal_xspi.h
  * @author  MCD Application Team
  * @brief   Header file of XSPI HAL module for supporting QuadSPI
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2020 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef STM32MP13xx_HAL_XSPI_H
#define STM32MP13xx_HAL_XSPI_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32mp13xx_hal_def.h"
#include "stm32mp13xx_hal_mdma.h"

#if defined(QUADSPI) || defined(QUADSPI1) || defined(QUADSPI2)

/** @addtogroup STM32MP13xx_HAL_Driver
  * @{
  */

/** @addtogroup XSPI
  * @{
  */

/* Exported types ------------------------------------------------------------*/
/** @defgroup XSPI_Exported_Types XSPI Exported Types
  * @{
  */

/**
  * @brief  XSPI Init structure definition
  */
typedef struct
{
  uint32_t ClockPrescaler;     /* Specifies the prescaler factor for generating clock based on the AHB clock.
                                  This parameter can be a number between 0 and 255 */
  uint32_t FifoThresholdByte;  /* Specifies the threshold number of bytes in the FIFO (used only in indirect mode)
                                  This parameter can be a value between 1 and 32. Earlier
                                  parameter FifoThreshold is renamed to FifoThresholdByte for better
                                  compatibility with ExtMem Manager */
  uint32_t SampleShifting;     /* Specifies the Sample Shift. The data is sampled 1/2 clock cycle delay later to
                                  take in account external signal delays.
                                  (It should be XSPI_SAMPLE_SHIFTING_NONE in DTR mode)
                                  This parameter can be a value of @ref XSPI_SampleShifting */
  uint32_t MemorySize;          /* Specifies the Memory Size. MemorySize+1 is effectively the number of address bits
                                  required to address the flash memory. The flash capacity can be up to 4GB
                                  (addressed using 32 bits) in indirect mode, but the addressable space in
                                  memory-mapped mode is limited to 256MB
                                  This parameter can be a number between 0 and 31. Earlier parameter
                                  FlashSize is renamed to MemorySize for better compatibility
                                  with ExtMem Manager */
  uint32_t ChipSelectHighTimeCycle; /* Specifies the Chip Select High Time. ChipSelectHighTimeCycle+1 defines
                                       the minimum number of clock cycles which the chip select must remain
                                       high between commands. Earlier parameter ChipSelectHighTime is renamed
                                       to FifoThresholdByte for better compatibility with ExtMem Manager
                                       This parameter can be a value of @ref XSPI_ChipSelectHighTimeCycle */
  uint32_t ClockMode;          /* Specifies the Clock Mode. It indicates the level that clock takes between commands.
                                  This parameter can be a value of @ref XSPI_ClockMode */
  uint32_t MemoryMode;         /* Specifies the Memory Mode State
                                  This parameter can be a value of @ref XSPI_DualFlash_Mode
                                  This has been renamed from DualFlash to MemoryMode for better compatibility with
                                  ExtMem Manager */
} XSPI_InitTypeDef;


/**
  * @brief  XSPI Handle Structure definition
  */
#if defined (USE_HAL_XSPI_REGISTER_CALLBACKS) && (USE_HAL_XSPI_REGISTER_CALLBACKS == 1U)
typedef struct __XSPI_HandleTypeDef
#else
typedef struct
#endif /* defined (USE_HAL_XSPI_REGISTER_CALLBACKS) && (USE_HAL_XSPI_REGISTER_CALLBACKS == 1U) */
{
  QUADSPI_TypeDef            *Instance;        /* XSPI registers base address        */
  XSPI_InitTypeDef           Init;             /* XSPI communication parameters      */
  uint8_t                    *pBuffPtr;        /* Pointer to XSPI Tx/Rx transfer Buffer */
  __IO uint32_t              XferSize;         /* XSPI Tx/Rx Transfer size              */
  __IO uint32_t              XferCount;        /* XSPI Tx/Rx Transfer Counter           */
  MDMA_HandleTypeDef          *hmdma;            /* XSPI Rx/Tx MDMA Handle parameters   */
  __IO HAL_LockTypeDef       Lock;             /* Locking object                     */
  __IO uint32_t State;            /* XSPI communication state           */
  __IO uint32_t              ErrorCode;        /* XSPI Error code                    */
  uint32_t                   Timeout;          /* Timeout for the XSPI memory access */
#if defined (USE_HAL_XSPI_REGISTER_CALLBACKS) && (USE_HAL_XSPI_REGISTER_CALLBACKS == 1U)
  void (* ErrorCallback)(struct __XSPI_HandleTypeDef *hxspi);
  void (* AbortCpltCallback)(struct __XSPI_HandleTypeDef *hxspi);
  void (* FifoThresholdCallback)(struct __XSPI_HandleTypeDef *hxspi);
  void (* CmdCpltCallback)(struct __XSPI_HandleTypeDef *hxspi);
  void (* RxCpltCallback)(struct __XSPI_HandleTypeDef *hxspi);
  void (* TxCpltCallback)(struct __XSPI_HandleTypeDef *hxspi);
  void (* RxHalfCpltCallback)(struct __XSPI_HandleTypeDef *hxspi);
  void (* TxHalfCpltCallback)(struct __XSPI_HandleTypeDef *hxspi);
  void (* StatusMatchCallback)(struct __XSPI_HandleTypeDef *hxspi);
  void (* TimeOutCallback)(struct __XSPI_HandleTypeDef *hxspi);

