zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/include/stm32mp13xx_hal_xspi.h
  void (* MspInitCallback)(struct __XSPI_HandleTypeDef *hxspi);
  void (* MspDeInitCallback)(struct __XSPI_HandleTypeDef *hxspi);
#endif /* defined (USE_HAL_XSPI_REGISTER_CALLBACKS) && (USE_HAL_XSPI_REGISTER_CALLBACKS == 1U) */
} XSPI_HandleTypeDef;

/**
  * @brief  XSPI Command structure definition
  */
typedef struct
{
  uint32_t Instruction;        /* Specifies the Instruction to be sent
                                  This parameter can be a value (8-bit) between 0x00 and 0xFF */
  uint32_t Address;            /* Specifies the Address to be sent (Size from 1 to 4 bytes according AddressWidth)
                                  This parameter can be a value (32-bits) between 0x0 and 0xFFFFFFFF */
  uint32_t AlternateBytes;     /* Specifies the Alternate Bytes to be sent (Size from 1 to 4 bytes
                                  according AlternateBytesWidth)
                                  This parameter can be a value (32-bits) between 0x0 and 0xFFFFFFFF */
  uint32_t AddressWidth;        /* Specifies the Address Width
                                  This parameter can be a value of @ref XSPI_AddressWidth
                                  Renamed from AddressSize to AddressWidth for better compatibility with
                                  ExtMem Manager */
  uint32_t AlternateBytesWidth; /* Specifies the Alternate Bytes Width
                                  This parameter can be a value of @ref XSPI_AlternateBytesWidth
                                  Renamed from AlternateBytesSize to AlternateBytesWidth for better
                                  compatibility with ExtMem Manager*/
  uint32_t DummyCycles;        /* Specifies the Number of Dummy Cycles.
                                  This parameter can be a number between 0 and 31 */
  uint32_t InstructionMode;    /* Specifies the Instruction Mode
                                  This parameter can be a value of @ref XSPI_InstructionMode */
  uint32_t AddressMode;        /* Specifies the Address Mode
                                  This parameter can be a value of @ref XSPI_AddressMode */
  uint32_t AlternateByteMode;  /* Specifies the Alternate Bytes Mode
                                  This parameter can be a value of @ref XSPI_AlternateBytesMode */
  uint32_t DataMode;           /* Specifies the Data Mode (used for dummy cycles and data phases)
                                  This parameter can be a value of @ref XSPI_DataMode */
  uint32_t DataLength;         /* Specifies the length of data to transfer. (This is the number of bytes)
                                  This parameter can be any value between 0 and 0xFFFFFFFF (0 means undefined length
                                  until end of memory)
                                  Renamed from NbData to DataLength for better compatibility with ExtMem Manager */
  uint32_t DTRMode;            /* Specifies the double transfer rate mode for address, alternate byte and data phase
                                  This parameter can be a value of @ref XSPI_DTRMode */
  uint32_t DelayHoldHalfCycle;   /* Specifies if the Delay hold is enabled. When enabled it delays the data
                                  output by one half of system clock in DTR mode. */
  uint32_t SIOOMode;               /* Specifies the send instruction only once mode
                                      This parameter can be a value of @ref XSPI_SIOOMode */
  uint32_t OperationType;          /* Dummy Parameter, used for compatibility only */

  uint32_t IOSelect;               /* Specifies the FlashID which will be used */

  uint32_t InstructionWidth;       /* Dummy Parameter, used for compatibility only */

  uint32_t InstructionDTRMode;     /* Dummy Parameter, used for compatibility only */

  uint32_t AddressDTRMode;         /* Dummy Parameter, used for compatibility only */

  uint32_t AlternateBytesDTRMode;  /* Dummy Parameter, used for compatibility only */

  uint32_t DataDTRMode;            /* Dummy Parameter, used for compatibility only */

  uint32_t DQSMode;                /* Dummy Parameter, used for compatibility only */
} XSPI_RegularCmdTypeDef;

/**
  * @brief  XSPI Auto Polling mode configuration structure definition
  */
typedef struct
{
  uint32_t MatchValue;         /* Specifies the value to be compared with the masked status register to get a match.
                                  This parameter can be any value between 0 and 0xFFFFFFFF */
  uint32_t MatchMask;          /* Specifies the mask to be applied to the status bytes received.
                                  This parameter can be any value between 0 and 0xFFFFFFFF */
  uint32_t IntervalTime;       /* Specifies the number of clock cycles between two read during automatic polling phases.
                                  This parameter can be any value between 0 and 0xFFFF */
  uint32_t MatchMode;          /* Specifies the method used for determining a match.
                                  This parameter can be a value of @ref XSPI_MatchMode */
  uint32_t AutomaticStop;      /* Specifies if automatic polling is stopped after a match.
                                  This parameter can be a value of @ref XSPI_AutomaticStop */
} XSPI_AutoPollingTypeDef;

/**
  * @brief  XSPI Memory Mapped mode configuration structure definition
  */
typedef struct
{
  uint32_t TimeoutPeriodClock; /* Specifies the number of clock to wait when the FIFO is full before to
                                  release the chip select.
                                  This parameter can be any value between 0 and 0xFFFF */
  uint32_t TimeOutActivation;  /* Specifies if the timeout counter is enabled to release the chip select.
                                  This parameter can be a value of @ref XSPI_TimeOutActivation */
} XSPI_MemoryMappedTypeDef;

#if defined (USE_HAL_XSPI_REGISTER_CALLBACKS) && (USE_HAL_XSPI_REGISTER_CALLBACKS == 1U)
/**
  * @brief  HAL XSPI Callback ID enumeration definition
  */
typedef enum
{
  HAL_XSPI_ERROR_CB_ID          = 0x00U,  /*!< XSPI Error Callback ID            */
  HAL_XSPI_ABORT_CB_ID          = 0x01U,  /*!< XSPI Abort Callback ID            */
  HAL_XSPI_FIFO_THRESHOLD_CB_ID = 0x02U,  /*!< XSPI FIFO Threshold Callback ID   */
  HAL_XSPI_CMD_CPLT_CB_ID       = 0x03U,  /*!< XSPI Command Complete Callback ID */
  HAL_XSPI_RX_CPLT_CB_ID        = 0x04U,  /*!< XSPI Rx Complete Callback ID      */
  HAL_XSPI_TX_CPLT_CB_ID        = 0x05U,  /*!< XSPI Tx Complete Callback ID      */
  HAL_XSPI_RX_HALF_CPLT_CB_ID   = 0x06U,  /*!< XSPI Rx Half Complete Callback ID */
  HAL_XSPI_TX_HALF_CPLT_CB_ID   = 0x07U,  /*!< XSPI Tx Half Complete Callback ID */
  HAL_XSPI_STATUS_MATCH_CB_ID   = 0x08U,  /*!< XSPI Status Match Callback ID     */
  HAL_XSPI_TIMEOUT_CB_ID        = 0x09U,  /*!< XSPI Timeout Callback ID          */

  HAL_XSPI_MSP_INIT_CB_ID       = 0x0AU,  /*!< XSPI MspInit Callback ID          */
  HAL_XSPI_MSP_DEINIT_CB_ID     = 0x0B0   /*!< XSPI MspDeInit Callback ID        */
} HAL_XSPI_CallbackIDTypeDef;

/**
  * @brief  HAL XSPI Callback pointer definition
  */
typedef void (*pXSPI_CallbackTypeDef)(XSPI_HandleTypeDef *hxspi);
#endif /* defined (USE_HAL_XSPI_REGISTER_CALLBACKS) && (USE_HAL_XSPI_REGISTER_CALLBACKS == 1U) */
/**
  * @}
  */


/* Exported types ------------------------------------------------------------*/
/** @defgroup XSPI_Exported_Variables XSPI Exported Variables
  * @{
  */
/* ConfigCmd needs to be populated by application code before invoking below APIs -:
1) HAL_XSPI_AutoPolling()
2) HAL_XSPI_AutoPolling_IT()
3) HAL_XSPI_MemoryMapped() */

