zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/include/stm32mp13xx_hal_xspi.h
extern XSPI_RegularCmdTypeDef ConfigCmd;

/**
  * @}
  */

/* Exported constants --------------------------------------------------------*/
/** @defgroup XSPI_Exported_Constants XSPI Exported Constants
  * @{
  */

/** @defgroup XSPI_State XSPI State
  * @{
  */
#define HAL_XSPI_STATE_RESET                 (0x00000000U)  /*!< Peripheral not initialized                            */
#define HAL_XSPI_STATE_READY                 (0x00000001U)  /*!< Peripheral initialized and ready for use              */
#define HAL_XSPI_STATE_BUSY                  (0x00000002U)  /*!< Peripheral in indirect mode and busy                  */
#define HAL_XSPI_STATE_BUSY_INDIRECT_TX      (0x00000012U)  /*!< Peripheral in indirect mode with transmission ongoing */
#define HAL_XSPI_STATE_BUSY_INDIRECT_RX      (0x00000022U)  /*!< Peripheral in indirect mode with reception ongoing    */
#define HAL_XSPI_STATE_BUSY_AUTO_POLLING     (0x00000042U)  /*!< Peripheral in auto polling mode ongoing               */
#define HAL_XSPI_STATE_BUSY_MEM_MAPPED       (0x00000082U)  /*!< Peripheral in memory mapped mode ongoing              */
#define HAL_XSPI_STATE_ABORT                 (0x00000008U)  /*!< Peripheral with abort request ongoing                 */
#define HAL_XSPI_STATE_ERROR                 (0x00000004U)  /*!< Peripheral in error                                   */
/**
  * @}
  */

/** @defgroup XSPI_ErrorCode XSPI Error Code
  * @{
  */
#define HAL_XSPI_ERROR_NONE             0x00000000U /*!< No error                 */
#define HAL_XSPI_ERROR_TIMEOUT          0x00000001U /*!< Timeout error            */
#define HAL_XSPI_ERROR_TRANSFER         0x00000002U /*!< Transfer error           */
#define HAL_XSPI_ERROR_DMA              0x00000004U /*!< DMA transfer error       */
#define HAL_XSPI_ERROR_INVALID_PARAM    0x00000008U /*!< Invalid parameters error */
#if defined (USE_HAL_XSPI_REGISTER_CALLBACKS) && (USE_HAL_XSPI_REGISTER_CALLBACKS == 1U)
#define HAL_XSPI_ERROR_INVALID_CALLBACK 0x00000010U /*!< Invalid callback error   */
#endif /* defined (USE_HAL_XSPI_REGISTER_CALLBACKS) && (USE_HAL_XSPI_REGISTER_CALLBACKS == 1U) */
/**
  * @}
  */

/** @defgroup XSPI_SampleShifting XSPI Sample Shifting
  * @{
  */
#define XSPI_SAMPLE_SHIFTING_NONE      0x00000000U                   /*!<No clock cycle shift to sample data*/
#define XSPI_SAMPLE_SHIFTING_HALFCYCLE ((uint32_t)QUADSPI_CR_SSHIFT) /*!<1/2 clock cycle shift to sample data*/
/**
  * @}
  */

/** @defgroup XSPI_ClockMode XSPI Clock Mode
  * @{
  */
#define XSPI_CLOCK_MODE_0              0x00000000U                    /*!<Clk stays low while nCS is released*/
#define XSPI_CLOCK_MODE_3              ((uint32_t)QUADSPI_DCR_CKMODE) /*!<Clk goes high while nCS is released*/
/**
  * @}
  */

/** @defgroup XSPI_Flash_Select XSPI Flash Select
  * @{
  */
#define HAL_XSPI_SELECT_IO_3_0                0x00000000U                    /*!<FLASH 1 selected*/
#define HAL_XSPI_SELECT_IO_7_4                ((uint32_t)QUADSPI_CR_FSEL)    /*!<FLASH 2 selected*/
/**
  * @}
  */

/** @defgroup XSPI_MEMORYMODE_Mode XSPI Memory Mode
  * @{
  */
#define HAL_XSPI_DUAL_MEM          ((uint32_t)QUADSPI_CR_DFM) /*!< Dual mode enabled                */
#define HAL_XSPI_SINGLE_MEM         0x00000000U            /*!< Dual-memory mode disabled        */
/**
  * @}
  */


/** @defgroup XSPI_AddressWidth XSPI Address Size
  * @{
  */
#define XSPI_ADDRESS_8_BITS            0x00000000U                      /*!<8-bit address*/
#define XSPI_ADDRESS_16_BITS           ((uint32_t)QUADSPI_CCR_ADSIZE_0) /*!<16-bit address*/
#define XSPI_ADDRESS_24_BITS           ((uint32_t)QUADSPI_CCR_ADSIZE_1) /*!<24-bit address*/
#define XSPI_ADDRESS_32_BITS           ((uint32_t)QUADSPI_CCR_ADSIZE)   /*!<32-bit address*/
/**
  * @}
  */

/** @defgroup XSPI_AlternateBytesWidth XSPI Alternate Bytes Size
  * @{
  */
#define XSPI_ALT_BYTES_8_BITS    0x00000000U                      /*!<8-bit alternate bytes*/
#define XSPI_ALT_BYTES_16_BITS   ((uint32_t)QUADSPI_CCR_ABSIZE_0) /*!<16-bit alternate bytes*/
#define XSPI_ALT_BYTES_24_BITS   ((uint32_t)QUADSPI_CCR_ABSIZE_1) /*!<24-bit alternate bytes*/
#define XSPI_ALT_BYTES_32_BITS   ((uint32_t)QUADSPI_CCR_ABSIZE)   /*!<32-bit alternate bytes*/
/**
  * @}
  */

/** @defgroup XSPI_InstructionMode XSPI Instruction Mode
  * @{
  */
#define XSPI_INSTRUCTION_NONE          0x00000000U                     /*!<No instruction*/
#define XSPI_INSTRUCTION_1_LINE        ((uint32_t)QUADSPI_CCR_IMODE_0) /*!<Instruction on a single line*/
#define XSPI_INSTRUCTION_2_LINES       ((uint32_t)QUADSPI_CCR_IMODE_1) /*!<Instruction on two lines*/
#define XSPI_INSTRUCTION_4_LINES       ((uint32_t)QUADSPI_CCR_IMODE)   /*!<Instruction on four lines*/
/**
  * @}
  */

/** @defgroup XSPI_AddressMode XSPI Address Mode
  * @{
  */
#define XSPI_ADDRESS_NONE              0x00000000U                      /*!<No address*/
#define XSPI_ADDRESS_1_LINE            ((uint32_t)QUADSPI_CCR_ADMODE_0) /*!<Address on a single line*/
#define XSPI_ADDRESS_2_LINES           ((uint32_t)QUADSPI_CCR_ADMODE_1) /*!<Address on two lines*/
#define XSPI_ADDRESS_4_LINES           ((uint32_t)QUADSPI_CCR_ADMODE)   /*!<Address on four lines*/
/**
  * @}
  */

/** @defgroup XSPI_AlternateBytesMode XSPI Alternate Bytes Mode
  * @{
  */
#define XSPI_ALT_BYTES_NONE      0x00000000U                      /*!<No alternate bytes*/
#define XSPI_ALT_BYTES_1_LINE    ((uint32_t)QUADSPI_CCR_ABMODE_0) /*!<Alternate bytes on a single line*/
#define XSPI_ALT_BYTES_2_LINES   ((uint32_t)QUADSPI_CCR_ABMODE_1) /*!<Alternate bytes on two lines*/
#define XSPI_ALT_BYTES_4_LINES   ((uint32_t)QUADSPI_CCR_ABMODE)   /*!<Alternate bytes on four lines*/
/**
  * @}
  */

/** @defgroup XSPI_DataMode XSPI Data Mode
  * @{
  */
#define XSPI_DATA_NONE                 0x00000000U                     /*!<No data*/
#define XSPI_DATA_1_LINE               ((uint32_t)QUADSPI_CCR_DMODE_0) /*!<Data on a single line*/
#define XSPI_DATA_2_LINES              ((uint32_t)QUADSPI_CCR_DMODE_1) /*!<Data on two lines*/
#define XSPI_DATA_4_LINES              ((uint32_t)QUADSPI_CCR_DMODE)   /*!<Data on four lines*/
/**
  * @}
  */

/** @defgroup XSPI_DTRMode XSPI DTR Mode
  * @{
  */
#define XSPI_DTR_MODE_DISABLE          0x00000000U                  /*!<Double transfer rate mode disabled*/
#define XSPI_DTR_MODE_ENABLE           ((uint32_t)QUADSPI_CCR_DDRM)    /*!<Double transfer rate mode enabled*/
/**
  * @}
  */

