zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/include/stm32mp13xx_hal_xspi.h
/* Private macros ------------------------------------------------------------*/
/** @defgroup XSPI_Private_Macros XSPI Private Macros
  * @{
  */
#define IS_XSPI_CLK_PRESCALER(PRESCALER) ((PRESCALER) <= 0xFFU)

/* Renamed from IS_XSPI_FIFO_THRESHOLD() to IS_XSPI_FIFO_THRESHOLD_BYTE for better compatibility with ExtMem Manager */
#define IS_XSPI_FIFO_THRESHOLD_BYTE(THR)        (((THR) > 0U) && ((THR) <= 32U))

#define IS_XSPI_SAMPLE_SHIFTING(SSHIFT)             (((SSHIFT) == XSPI_SAMPLE_SHIFTING_NONE) || \
                                                     ((SSHIFT) == XSPI_SAMPLE_SHIFTING_HALFCYCLE))

#define IS_XSPI_MEMORY_SIZE(SIZE)          (((SIZE) <= 31U))

#define IS_XSPI_CS_HIGH_TIME_CYCLE(TIME)   (((TIME) >= 1U) && ((TIME) <= 8U))

#define IS_XSPI_CLOCK_MODE(CLKMODE)        (((CLKMODE) == XSPI_CLOCK_MODE_0) || \
                                            ((CLKMODE) == XSPI_CLOCK_MODE_3))

#define IS_XSPI_IO_SELECT(MEMSEL)           (((MEMSEL) == HAL_XSPI_SELECT_IO_3_0) || \
                                             ((MEMSEL) == HAL_XSPI_SELECT_IO_7_4))
#define IS_XSPI_MEMORY_MODE(MODE)      (((MODE) == HAL_XSPI_DUAL_MEM) || \
                                        ((MODE) == HAL_XSPI_SINGLE_MEM))
#define IS_XSPI_INSTRUCTION(INSTRUCTION)   ((INSTRUCTION) <= 0xFFU)

/* Renamed IS_XSPI_ADDRESS_SIZE() to IS_XSPI_ADDRESS_WIDTH() for better compatibility with ExtMem Manager */
#define IS_XSPI_ADDRESS_WIDTH(ADDR_WIDTH)    (((ADDR_WIDTH) == XSPI_ADDRESS_8_BITS)  || \
                                              ((ADDR_WIDTH) == XSPI_ADDRESS_16_BITS) || \
                                              ((ADDR_WIDTH) == XSPI_ADDRESS_24_BITS) || \
                                              ((ADDR_WIDTH) == XSPI_ADDRESS_32_BITS))

/* Renamed IS_XSPI_ALT_BYTES_SIZE() to IS_XSPI_ALT_BYTES_WIDTH() for better compatibility with
ExtMem Manager */
#define IS_XSPI_ALT_BYTES_WIDTH(SIZE) (((SIZE) == XSPI_ALT_BYTES_8_BITS)  || \
                                       ((SIZE) == XSPI_ALT_BYTES_16_BITS) || \
                                       ((SIZE) == XSPI_ALT_BYTES_24_BITS) || \
                                       ((SIZE) == XSPI_ALT_BYTES_32_BITS))

#define IS_XSPI_DUMMY_CYCLES(DCY)          ((DCY) <= 31U)

#define IS_XSPI_INSTRUCTION_MODE(MODE)     (((MODE) == XSPI_INSTRUCTION_NONE)    || \
                                            ((MODE) == XSPI_INSTRUCTION_1_LINE)  || \
                                            ((MODE) == XSPI_INSTRUCTION_2_LINES) || \
                                            ((MODE) == XSPI_INSTRUCTION_4_LINES))

#define IS_XSPI_ADDRESS_MODE(MODE)         (((MODE) == XSPI_ADDRESS_NONE)    || \
                                            ((MODE) == XSPI_ADDRESS_1_LINE)  || \
                                            ((MODE) == XSPI_ADDRESS_2_LINES) || \
                                            ((MODE) == XSPI_ADDRESS_4_LINES))

#define IS_XSPI_ALT_BYTES_MODE(MODE) (((MODE) == XSPI_ALT_BYTES_NONE)    || \
                                      ((MODE) == XSPI_ALT_BYTES_1_LINE)  || \
                                      ((MODE) == XSPI_ALT_BYTES_2_LINES) || \
                                      ((MODE) == XSPI_ALT_BYTES_4_LINES))

#define IS_XSPI_DATA_MODE(MODE)            (((MODE) == XSPI_DATA_NONE)    || \
                                            ((MODE) == XSPI_DATA_1_LINE)  || \
                                            ((MODE) == XSPI_DATA_2_LINES) || \
                                            ((MODE) == XSPI_DATA_4_LINES))

#define IS_XSPI_DTR_MODE(DTR_MODE)         (((DTR_MODE) == XSPI_DTR_MODE_DISABLE) || \
                                            ((DTR_MODE) == XSPI_DTR_MODE_ENABLE))

#define IS_XSPI_DHHC(DHHC)           (((DHHC) == XSPI_DHHC_ANALOG_DELAY) || \
                                      ((DHHC) == XSPI_DHHC_HALF_CLK_DELAY))

#define IS_XSPI_SIOO_MODE(SIOO_MODE)       (((SIOO_MODE) == XSPI_SIOO_INST_EVERY_CMD) || \
                                            ((SIOO_MODE) == XSPI_SIOO_INST_ONLY_FIRST_CMD))

#define IS_XSPI_INTERVAL(INTERVAL)         ((INTERVAL) <= QUADSPI_PIR_INTERVAL)

#define IS_XSPI_STATUS_BYTES_SIZE(SIZE)    (((SIZE) >= 1U) && ((SIZE) <= 4U))

#define IS_XSPI_MATCH_MODE(MODE)           (((MODE) == XSPI_MATCH_MODE_AND) || \
                                            ((MODE) == XSPI_MATCH_MODE_OR))

#define IS_XSPI_AUTOMATIC_STOP(APMS)       (((APMS) == XSPI_AUTOMATIC_STOP_DISABLE) || \
                                            ((APMS) == XSPI_AUTOMATIC_STOP_ENABLE))

#define IS_XSPI_TIMEOUT_ACTIVATION(TCEN)   (((TCEN) == XSPI_TIMEOUT_COUNTER_DISABLE) || \
                                            ((TCEN) == XSPI_TIMEOUT_COUNTER_ENABLE))

#define IS_XSPI_TIMEOUT_PERIOD(PERIOD)     ((PERIOD) <= 0xFFFFU)

/**
  * @}
  */
/* End of private macros -----------------------------------------------------*/

/**
  * @}
  */

/**
  * @}
  */

#endif /* defined(XSPI) */

#ifdef __cplusplus
}
#endif

#endif /* STM32MP13xx_HAL_XSPI_H */
